# Exercise 4.6 Combining and Exporting Data

3. In a new notebook, import the orders_products_combined dataframe from the pickle file you just saved.

In [1]:
#importing database
import os
import numpy as np
import pandas as pd

In [2]:
#setting path
path = r'C:\Users\ProUser11\Desktop\DATA ANALYSIS\Tasks\Module 5\4.1\2020 Instacart Basket Analysis'

In [3]:
#importing orders_products_combined.pkl
df_orders_products_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [5]:
# Importing products_checked.csv
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

4. Check the shape of the imported dataframe (it should be the same as the one you exported—always check!).

In [6]:
df_orders_products_combined.shape

(32434489, 12)

In [7]:
df_orders_products_combined.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [8]:
df_prods.shape

(49672, 6)

In [9]:
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [10]:
# cleaning unecessary columns
df_prods = df_prods.drop(columns = ['Unnamed: 0'])

In [11]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

5. Determine a suitable way to combine the orders_products_combined dataframe with your products data set. Make sure you’re using your wrangled, cleaned, and deduped products data set stored in your “Prepared Data” folder from the previous Exercise’s task.

In [12]:
# I will use the product_id column to merge both of these dataframes.

In [13]:
# Dropping _merge column from df_orders_products_combined
df_orders_products_combined = df_orders_products_combined.drop(columns = ['_merge'])

In [ ]:
#Merging df_orders_products_combined with df_prods
df_merged = df_orders_products_combined.merge(df_prods, on = 'product_id', indicator = True)

In [29]:
# Checking output
df_merged.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,0,0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,1,1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,2,2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,3,3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,4,4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [30]:
#checking merged shape
df_merged.shape

(32404859, 16)

In [32]:
# cleaning unecessary columns
df_merged = df_merged.drop(columns = ['Unnamed: 0.1','Unnamed: 0'])

In [33]:
# Checking output
df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [34]:
#checking merged shape
df_merged.shape

(32404859, 14)

6. Confirm the results of the merge using the merge flag.

In [35]:
# Checking value counts for '_merge' column
df_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

7. Export the newly created dataframe as orders_products_merged in a suitable format (taking into consideration the size).

In [40]:
# exporting pkl file
df_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))